app/controllers/comentarios_controller.rb

SELECT * FROM `comentarios`
---
  def index
    @comentarios = Comentario.all

SELECT * FROM `comentarios` WHERE (`comentarios`.`id` = 1)
---
  def show
    @comentario = Comentario.find(params[:id])

SELECT * FROM `comentarios` WHERE (`comentarios`.`id` = 2)
---
  def edit
    @comentario = Comentario.find(params[:id])

INSERT INTO `comentarios` (`updated_at`, `conteudo`, `comentavel_type`, `comentavel_id`, `created_at`) VALUES('2010-05-12 23:03:20', 'Opa!', 'Restaurante', 1, '2010-05-12 23:03:20')
---
  def create
    @comentario = Comentario.new(params[:comentario])

    respond_to do |format|
      if @comentario.save

SELECT * FROM `comentarios` WHERE (`comentarios`.`id` = 2)
DELETE FROM `comentarios` WHERE `id` = 2
---
  def destroy
    @comentario = Comentario.find(params[:id])
    @comentario.destroy