app/controllers/restaurantes_controller.rb

SELECT * FROM `restaurantes` ORDER BY nome LIMIT 0, 3
SELECT count(*) AS count_all FROM `restaurantes`
---
  def index
#   @restaurantes = Restaurante.find(:all, :order => "nome")
    @restaurantes = Restaurante.paginate :page=> params['page'], :per_page=>3, :order => "nome"

SELECT * FROM `restaurantes` WHERE (`restaurantes`.`id` = 5)
---
  def show
    @restaurante = Restaurante.find(params[:id])

INSERT INTO `restaurantes` (`updated_at`, `especialidade`, `endereco`, `nome`, `created_at`) VALUES('2010-05-11 00:48:02', 'Sanduíches', 'Largo Padre Péricles', 'Ponto Chic', '2010-05-11 00:48:02')
---
  def create
    @restaurante = Restaurante.new(params[:restaurante])
    if @restaurante.save

SELECT * FROM `restaurantes` WHERE (`restaurantes`.`id` = 1)
---
  def edit
    @restaurante = Restaurante.find(params[:id])

SELECT * FROM `restaurantes` WHERE (`restaurantes`.`id` = 1)
UPDATE `restaurantes` SET `endereco` = 'São Carlos - SP', `updated_at` = '2010-05-11 00:53:30' WHERE `id` = 1
---
  def update
    @restaurante = Restaurante.find(params[:id])
    if @restaurante.update_attributes(params[:restaurante])

SELECT * FROM `restaurantes` WHERE (`restaurantes`.`id` = 3)
DELETE FROM `restaurantes` WHERE `id` = 3
---
  def destroy
    @restaurante = Restaurante.find(params[:id])
    @restaurante.destroy

SELECT * FROM `restaurantes` WHERE (`restaurantes`.`especialidade` = 'italiana') LIMIT 1
---
  def busca
    @restaurantes = []
    @restaurantes << Restaurante.find_by_especialidade(params[:teste])